/*Да се напише функција која како аргументи добива низа од цели броеви и должина на
низата. Функцијата треба да ја подреди низата, така што најпрвин ќе дојдат парните
броеви а потоа непарните броеви (притоа да не се подредуваат според вредноста на
елементот туку само по тоа дали е парен или непарен). Да се земе во предвид дека 0 е
парен број. На крај функцијата треба да ја отпечати низата по трансформацијата. Да
се напише главна програма за тестирање на работењето на функцијата.*/
#include <stdio.h>
void podredi(int *niza, int n) {
  int i, pom;
  for(i=n-1;i>0;i--) {
    for(int j=0;j<i;j++) {
      if(niza[j]%2!=0) {
        pom=niza[j];
        niza[j]=niza[j+1];
        niza[j+1]=pom;
      }
    }
    }
}

void printArray(int *niza, int n) {
  for(int i=0;i<n;i++) {
    printf("%d ", niza[i]);
  }
}
int main() {
int niza[]={7, 2, 15, 0, -3, 2, 5};
podredi(niza, 7);
printArray(niza, 7);

  return 0;
}